# Mandatory Challenge
## Context
You work in the data analysis team of a very important company. On Monday, the company shares some good news with you: you just got hired by a major retail company! So, let's get prepared for a huge amount of work!

Then you get to work with your team and define the following tasks to perform:   
1. You need to start your analysis using data from the past.  
2. You need to define a process that takes your daily data as an input and integrates it.  

You are in charge of the second part, so you are provided with a sample file that you will have to read daily. To complete you task, you need the following aggregates:
* One aggregate per store that adds up the rest of the values.
* One aggregate per item that adds up the rest of the values.

You can import the dataset `retail_sales` from Ironhack's database. 

## Your task
Therefore, your process will consist of the following steps:
1. Read the sample file that a daily process will save in your folder. 
2. Clean up the data.
3. Create the aggregates.
4. Write three tables in your local database: 
    - A table for the cleaned data.
    - A table for the aggregate per store.
    - A table for the aggregate per item.

## Instructions
* Read the csv you can find in Ironhack's database.
* Clean the data and create the aggregates as you consider.
* Create the tables in your local database.
* Populate them with your process.

In [1]:
# your code here
from sqlalchemy import create_engine
import pandas as pd

driver = 'mysql+pymysql:'
user = 'ironhacker_read'
password = 'ir0nhack3r'
ip = '35.239.232.23'
database = 'retail_sales'

engine = f'{driver}//{user}:{password}@{ip}/{database}'

query = """
        SELECT * FROM raw_sales
"""
    
retail = pd.read_sql(query, engine)

In [ ]:
retail.info()
'''So we can see there are no NaN Numbers, so the only thing we can do is to look for outliers,
but I will not do it because the maximum price of an item is 27990 (shown below), and as we have real 
items with values of 19900 we won't say those values are wrong'''

In [ ]:
ag_per_item = retail.drop(["shop_id","date"],1)
'''For this table I'll delete the shop_id column as it's not useful (some items )'''

In [ ]:
ag_per_item.head()

In [ ]:
ag_per_item.min()
#There is a problem with the minimum of the quantity. Let's say it's positive:

In [ ]:
ag_per_item["item_cnt_day"] = ag_per_item['item_cnt_day'].apply(lambda x: x if x > 0.0 else -x)
#Negative prices changed

In [ ]:
ag_per_item.min()

In [ ]:
ag_per_item = retail.groupby(["item_id","item_price"]).sum()
ag_per_item.min()
#I don't know why i'm still having the shop ID but i'll remove it

In [ ]:
ag_per_item = ag_per_item.drop("shop_id", inplace=True, axis=1)

In [ ]:
#It's not working as it's dropping all the table

In [2]:
reven = retail

In [3]:
reven.head()

        date  shop_id  item_id  item_price  item_cnt_day
0 2015-01-04       29     1469      1199.0           1.0
1 2015-01-04       28    21364       479.0           1.0
2 2015-01-04       28    21365       999.0           2.0
3 2015-01-04       28    22104       249.0           2.0
4 2015-01-04       28    22091       179.0           1.0

In [6]:
reven["Revenue"] = reven.item_price * reven.item_cnt_day

In [8]:
reven.head()

        date  shop_id  item_id  item_price  item_cnt_day  Revenue
0 2015-01-04       29     1469      1199.0           1.0   1199.0
1 2015-01-04       28    21364       479.0           1.0    479.0
2 2015-01-04       28    21365       999.0           2.0   1998.0
3 2015-01-04       28    22104       249.0           2.0    498.0
4 2015-01-04       28    22091       179.0           1.0    179.0

In [9]:
reven.groupby(["shop_id","item_id"]).sum().head()

                 item_price  item_cnt_day  Revenue
shop_id item_id
2       1970        26997.0           3.0  26997.0
        1971        13497.0           3.0  13497.0
        2871         2997.0           3.0   2997.0
        2881         2997.0           3.0   2997.0
        3028         7797.0           3.0   7797.0